_posts/2019-08-28-vim.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd2fddf5">1. Vim粘贴代码时缩进混乱</a>
<ul>
<li><a href="#org75082b4">1.1. 取消自动缩进</a></li>
<li><a href="#org4cd94d0">1.2. paste mode</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd2fddf5" class="outline-2">
<h2 id="orgd2fddf5"><span class="section-number-2">1</span> Vim粘贴代码时缩进混乱</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org75082b4" class="outline-3">
<h3 id="org75082b4"><span class="section-number-3">1.1</span> 取消自动缩进</h3>
<div class="outline-text-3" id="text-1-1">
<p>
在命令模式下，使用“:set nosmartindent”和“:set noautoindent”取消自动缩进，然后再粘贴即可。完成后再开启自动缩进“:set smartindent”和“:set autoindent”，以上命令都可使用简写，比如“:set si”，可通过Vim的帮助“:help smartindent”查看相应说明。<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> 
</p>
</div>
</div>

<div id="outline-container-org4cd94d0" class="outline-3">
<h3 id="org4cd94d0"><span class="section-number-3">1.2</span> paste mode</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Vim的编辑模式中，还有一个Paste模式，在该模式下，可将文本原本的粘贴到Vim中，以避免一些格式错误。通过“:set paste”和“:set nopaste”进入和退出该模式。更简便的方式是，在Vim中设置一个进入和退出Paste模式的快捷键，往“~/.vimrc”中添加一行配置“set pastetoggle=&lt;F12&gt;”，这样即可通过F12快速的在Paste模式中切换，当然快捷键在不冲突的前提下可以任意指定，具体如何指定，参考附带的教程链接。<sup><a id="fnr.1.100" class="footref" href="#fn.1">1</a></sup>
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://my.oschina.net/joshuazhan/blog/122539">https://my.oschina.net/joshuazhan/blog/122539</a>
</p></div></div>


</div>
</div>
